jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/******************************************************************************
 SparkFunLSM6DSO.h
 LSM6DSO Arduino and Teensy Driver

 Marshall Taylor @ SparkFun Electronics
 May 20, 2015
 https://github.com/sparkfun/LSM6DSO_Breakout
 https://github.com/sparkfun/SparkFun_LSM6DSO_Arduino_Library

 Resources:
 Uses Wire.h for i2c operation
 Uses SPI.h for SPI operation
 Either can be omitted if not used

 Development environment specifics:
 Arduino IDE 1.8.1
 Teensy loader 1.23

 This code is released under the [MIT License](http://opensource.org/licenses/MIT).

 Please review the LICENSE.md file included with this example. If you have any questions
 or concerns with licensing, please contact techsupport@sparkfun.com.

 Distributed as-is; no warranty is given.
 ******************************************************************************/

#ifndef __LSM6DSOIMU_H__
#define __LSM6DSOIMU_H__

#include <stdint.h>

#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_spi.h"

typedef void (*SetCs)();
typedef void (*ClearCs)();

#define I2C_MODE 0
#define SPI_MODE 1
#define SPI_READ_COMMAND 0x80
#define DEFAULT_ADDRESS 0x6B
#define ALT_ADDRESS 0x6A

// Return values
typedef enum {
  IMU_SUCCESS = 0x00,
  IMU_HW_ERROR,
  IMU_NOT_SUPPORTED,
  IMU_OUT_OF_BOUNDS,
  IMU_ALL_ONES_WARNING,
  IMU_GENERIC_ERROR = 0xFF,
} status_t;

//  This is the core operational class of the driver.
//  LSM6DSOCore contains only read and write operations towards the IMU.
//  To use the higher level functions, use the class LSM6DSO which inherits
//  this class.

class LSM6DSOCore {
public:
  status_t readMultipleRegisters(uint8_t*, uint8_t, uint8_t);
  status_t readRegister(uint8_t*, uint8_t);
  status_t readRegisterInt16(int16_t*, uint8_t);
  status_t writeRegister(uint8_t, uint8_t);
  status_t writeMultipleRegisters(uint8_t*, uint8_t, uint8_t);
  status_t enableEmbeddedFunctions(bool = true);

protected:
  LSM6DSOCore(bool lowAcc);
  SetCs enable_cs;
  ClearCs disable_cs;

  HAL_StatusTypeDef spi_write(uint8_t regAddress, uint8_t* data, uint16_t len);
  HAL_StatusTypeDef spi_read(uint8_t regAddress, uint8_t* data, uint16_t len);
};

//This struct holds the settings the driver uses to do calculations
struct SensorSettings {
public:

  //Gyro settings
  bool gyroEnabled;
  uint16_t gyroRange;
  uint16_t gyroSampleRate;
  uint16_t gyroBandWidth;

  uint8_t gyroFifoEnabled;
  uint8_t gyroAccelDecimation;

  //Accelerometer settings
  bool accelEnabled;
  uint8_t accelODROff;
  uint16_t accelRange;
  uint16_t accelSampleRate;
  uint16_t accelBandWidth;

  uint8_t accelFifoEnabled;

  //Non-basic mode settings
  uint8_t commMode;

  //FIFO control data
  bool fifoEnabled;
  uint16_t fifoThreshold;
  int16_t fifoSampleRate;
  uint8_t fifoModeWord;

};

struct fifoData {
public:
  uint8_t fifoTag;
  float xAccel;
  float yAccel;
  float zAccel;

  float xGyro;
  float yGyro;
  float zGyro;

  float temperatureC;
  float temperatureF;
};

//This is the highest level class of the driver.
//LSM6DSO inherits LSM6DSOcore and makes use of the beginCore()
//method through it's own begin() method.  It also contains the
//settings struct to hold user settings.

#define ACCEL_DATA_READY 0x01
#define GYRO_DATA_READY 0x02
#define TEMP_DATA_READY 0x04
#define ALL_DATA_READY 0x07

#define BASIC_SETTINGS 0x00
#define SOFT_INT_SETTINGS 0x01
#define HARD_INT_SETTINGS 0x02
#define FIFO_SETTINGS 0x03
#define PEDOMETER_SETTINGS 0x04
#define TAP_SETTINGS 0x05
#define FREE_FALL_SETTINGS 0x06

struct SensorData {
  int16_t temperature;
  int16_t gyroX;
  int16_t gyroY;
  int16_t gyroZ;
  int16_t accX;
  int16_t accY;
  int16_t accZ;
};

enum LSM6DSO_REGISTERS {

  FUNC_CFG_ACCESS = 0x01,
  LSM6DO_PIN_CTRL = 0x02,

  FIFO_CTRL1 = 0x07,
  FIFO_CTRL2 = 0x08,
  FIFO_CTRL3 = 0x09,
  FIFO_CTRL4 = 0x0A,

  COUNTER_BDR_REG1 = 0x0B,
  COUNTER_BDR_REG2 = 0x0C,

  INT1_CTRL = 0x0D,
  INT2_CTRL = 0x0E,
  WHO_AM_I_REG = 0x0F,
  CTRL1_XL = 0x10,
  CTRL2_G = 0x11,
  CTRL3_C = 0x12,
  CTRL4_C = 0x13,
  CTRL5_C = 0x14,
  CTRL6_C = 0x15,
  CTRL7_G = 0x16,
  CTRL8_XL = 0x17,
  CTRL9_XL = 0x18,
  CTRL10_C = 0x19,
  ALL_INT_SRC = 0x1A,
  WAKE_UP_SRC = 0x1B,
  TAP_SRC = 0x1C,
  D6D_SRC = 0x1D,
  STATUS_REG = 0x1E,
  OUT_TEMP_L = 0x20,
  OUT_TEMP_H = 0x21,
  OUTX_L_G = 0x22,
  OUTX_H_G = 0x23,
  OUTY_L_G = 0x24,
  OUTY_H_G = 0x25,
  OUTZ_L_G = 0x26,
  OUTZ_H_G = 0x27,

  OUTX_L_A = 0x28,
  OUTX_H_A = 0x29,
  OUTY_L_A = 0x2A,
  OUTY_H_A = 0x2B,
  OUTZ_L_A = 0x2C,
  OUTZ_H_A = 0x2D,

  EMB_FUNC_STATUS_MP = 0x35,
  FSM_FUNC_STATUS_A_MP = 0x36,
  FSM_FUNC_STATUS_B_MP = 0x37,
  STATUS_MASTER_MAINPAGE = 0x39,

  FIFO_STATUS1 = 0x3A,
  FIFO_STATUS2 = 0x3B,

  TIMESTAMP0_REG = 0x40,
  TIMESTAMP1_REG = 0x41,
  TIMESTAMP2_REG = 0x42,
  TIMESTAMP3_REG = 0x43,

  TAP_CFG0 = 0x56,
  TAP_CFG1 = 0x57,
  TAP_CFG2 = 0x58,
  TAP_THS_6D = 0x59,
  INT_DUR2 = 0x5A,
  WAKE_UP_THS = 0x5B,
  WAKE_UP_DUR = 0x5C,
  FREE_FALL = 0x5D,
  MD1_CFG = 0x5E,
  MD2_CFG = 0x5F,

  I3C_BUS_AVB = 0x62,
  INTERNAL_FREQ_FINE = 0x63,

  INT_OIS = 0x6F,
  CTRL1_OIS = 0x70,
  CTRL2_OIS = 0x71,
  CTRL3_OIS = 0x72,
  X_OFS_USR = 0x73,
  Y_OFS_USR = 0x74,
  Z_OFS_USR = 0x75,

  FIFO_DATA_OUT_TAG = 0x78,
  FIFO_DATA_OUT_X_L = 0x79,
  FIFO_DATA_OUT_X_H = 0x7A,
  FIFO_DATA_OUT_Y_L = 0x7B,
  FIFO_DATA_OUT_Y_H = 0x7C,
  FIFO_DATA_OUT_Z_L = 0x7D,
  FIFO_DATA_OUT_Z_H = 0x7E,

};

#define GYRO_RAM_SIZE 4096

enum EMBEDDED_REGISTERS {

  PAGE_SEL = 0x02,
  EMB_FUNC_EN_A = 0x04,
  EMB_FUNC_EN_B = 0x05,
  PAGE_ADDRESS = 0x08,
  PAGE_VALUE = 0x09,
  EMB_FUNC_INT1 = 0x0A,
  FSM_INT1_A = 0x0B,
  FSM_INT1_B = 0x0C,
  EMB_FUNC_INT2 = 0x0E,
  FSM_INT2_A = 0x0F,
  FSM_INT2_B = 0x10,
  EMB_FUNC_STATUS = 0x12,
  FSM_STATUS_A = 0x13,
  FSM_STATUS_B = 0x14,
  PAGE_RW = 0x17,
  // RESERVED            = 0x18-0x43,
  EMB_FUNC_FIFO_CFG = 0x44,
  FSM_ENABLE_A = 0x46,
  FSM_ENABLE_B = 0x47,
  FSM_LONG_COUNTER_L = 0x48,
  FSM_LONG_COUNTER_H = 0x49,
  FSM_LONG_COUNTER_CLEAR = 0x4A,
  FSM_OUTS1 = 0x4C,
  FSM_OUTS2 = 0x4D,
  FSM_OUTS3 = 0x4E,
  FSM_OUTS4 = 0x4F,
  FSM_OUTS5 = 0x50,
  FSM_OUTS6 = 0x51,
  FSM_OUTS7 = 0x52,
  FSM_OUTS8 = 0x53,
  FSM_OUTS9 = 0x54,
  FSM_OUTS10 = 0x55,
  FSM_OUTS11 = 0x56,
  FSM_OUTS12 = 0x57,
  FSM_OUTS13 = 0x58,
  FSM_OUTS14 = 0x59,
  FSM_OUTS15 = 0x5A,
  FSM_OUTS16 = 0x5B,
  //RESERVED             = 0x5E
  EMB_FUNC_ODR_CFG_B = 0x5F,
  STEP_COUNTER_L = 0x62,
  STEP_COUNTER_H = 0x63,
  EMB_FUNC_SRC = 0x64,
  EMB_FUNC_INIT_A = 0x66,
  EMB_FUNC_INIT_B = 0x67

