jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
};

struct FifoStatusBits {
  uint8_t diff_fifo :2;
  uint8_t reserved :1;
  uint8_t fifo_over_latched :1;
  uint8_t counter_bdr_ia :1;
  uint8_t fifo_full_ia :1;
  uint8_t fifo_over_ia :1;
  uint8_t fifo_wtm_ia :1;
};

// Fifo Tags - not a complete list.
enum LSM6DSO_FIFO_TAGS {

  GYROSCOPE_DATA = 0x01,
  ACCELEROMETER_DATA,
  TEMPERATURE_DATA,
  TIMESTAMP_DATA,
  CFG_CHANGE_DATA,
  ACCELERTOMETER_DATA_T_2,
  ACCELERTOMETER_DATA_T_1,
  ACCELERTOMETER_DATA_2xC,
  ACCELERTOMETER_DATA_3xC,
  GYRO_DATA_T_2,
  GYRO_DATA_T_1,
  GYRO_DATA_2xC,
  GYRO_DATA_3xC,

};

/*******************************************************************************
 * Register      : FIFO_CTRL2
 * Address       : 0x08
 * Bit Group Name: STOP_ON_WTM
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_STOP_ON_WTM {
  FIFO_STOP_ON_WTM_DISABLED = 0x00,
  FIFO_STOP_ON_WTM_ENABLED = 0x80,
  FIFO_STOP_ON_WTM_MASK = 0x7F
};

/*******************************************************************************
 * Register      : FIFO_CTRL2
 * Address       : 0x08
 * Bit Group Name: FIFO_COMPR_RT_EN
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FIFO_COMPR_RT {
  FIFO_COMPR_RT_DISABLED = 0x00,
  FIFO_COMPR_RT_ENABLE = 0x40,
  FIFO_COMPR_RT_MASK = 0xBF
};

/*******************************************************************************
 * Register      : FIFO_CTRL2
 * Address       : 0x08
 * Bit Group Name: ODRCHG_EN
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FIFO_ODRCHG {
  FIFO_ODRCHG_DISABLED = 0x00,
  FIFO_ODRCHG_ENABLE = 0x10,
  FIFO_ODRCHG_MASK = 0xEF
};

/*******************************************************************************
 * Register      : FIFO_CTRL2
 * Address       : 0x08
 * Bit Group Name: UNCOPTR_RATE
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FIFO_UNCOPTR_RATE {
  FIFO_UNCOPTR_RATE_DISABLED = 0x00,
  FIFO_UNCOPTR_RATE_8 = 0x02,
  FIFO_UNCOPTR_RATE_16 = 0x04,
  FIFO_UNCOPTR_RATE_32 = 0x06,
  FIFO_UNCOPTR_RATE_MASK = 0xF9
};

/*******************************************************************************
 * Register      : FIFO_CTRL3
 * Address       : 0x09
 * Bit Group Name: BDR_GY
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_BDR_GY_FIFO {
  FIFO_BDR_GYRO_NOT_BATCHED = 0x00,
  FIFO_BDR_GYRO_12_5Hz = 0x10,
  FIFO_BDR_GYRO_26Hz = 0x20,
  FIFO_BDR_GYRO_52Hz = 0x30,
  FIFO_BDR_GYRO_104Hz = 0x40,
  FIFO_BDR_GYRO_208Hz = 0x50,
  FIFO_BDR_GYRO_417Hz = 0x60,
  FIFO_BDR_GYRO_833Hz = 0x70,
  FIFO_BDR_GYRO_1667Hz = 0x80,
  FIFO_BDR_GYRO_3333Hz = 0x90,
  FIFO_BDR_GYRO_6667Hz = 0xA0,
  FIFO_BDR_GYRO_6_5Hz = 0xB0,
  FIFO_BDR_GYRO_MASK = 0x0F
};

/*******************************************************************************
 * Register      : FIFO_CTRL3
 * Address       : 0x09
 * Bit Group Name: BDR_Xl
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_BDR_XL_FIFO {
  FIFO_BDR_ACC_NOT_BATCHED = 0x00,
  FIFO_BDR_ACC_12_5Hz = 0x01,
  FIFO_BDR_ACC_26Hz = 0x02,
  FIFO_BDR_ACC_52Hz = 0x03,
  FIFO_BDR_ACC_104Hz = 0x04,
  FIFO_BDR_ACC_208Hz = 0x05,
  FIFO_BDR_ACC_417Hz = 0x06,
  FIFO_BDR_ACC_833Hz = 0x07,
  FIFO_BDR_ACC_1667Hz = 0x08,
  FIFO_BDR_ACC_3333Hz = 0x09,
  FIFO_BDR_ACC_6667Hz = 0x0A,
  FIFO_BDR_ACC_1_6Hz = 0x0B,
  FIFO_BDR_ACC_MASK = 0xF0
};

/*******************************************************************************
 * Register      : FIFO_CTRL4
 * Address       : 0x0A
 * Bit Group Name: DEC_TS_BATCH
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FIFO_TS_DEC {
  FIFO_TS_DEC_DISABLED = 0x00,
  FIFO_TS_DEC_BY_1 = 0x04,
  FIFO_TS_DEC_BY_8 = 0x08,
  FIFO_TS_DEC_BY_32 = 0x0C
};

/*******************************************************************************
 * Register      : FIFO_CTRL4
 * Address       : 0x0A
 * Bit Group Name: ODR_T_BATCH_
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_TEMPERATURE_ODR_BATCH {
  FIFO_TEMP_ODR_DISABLE = 0x00,
  FIFO_TEMP_ODR_1_6 = 0x10,
  FIFO_TEMP_ODR_12_5 = 0x20,
  FIFO_TEMP_ORD_52 = 0x30
};

/*******************************************************************************
 * Register      : FIFO_CTRL4
 * Address       : 0x0A
 * Bit Group Name: FIFO_MODE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  FIFO_MODE_DISABLED = 0x00,
  FIFO_MODE_STOP_WHEN_FULL = 0x01,
  FIFO_MODE_CONT_TO_FIFO = 0x03,
  FIFO_MODE_BYPASS_TO_CONT = 0x04,
  FIFO_MODE_CONTINUOUS = 0x06,
  FIFO_MODE_BYPASS_TO_FIFO = 0x07,
  FIFO_MODE_MASK = 0xF0
} LSM6DSO_FIFO_MODE_t;

/*******************************************************************************
 * Register      : ORIENT_CFG_G
 * Address       : 0x0B
 * Bit Group Name: ORIENT
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  ORIENT_XYZ = 0x00,
  ORIENT_XZY = 0x01,
  ORIENT_YXZ = 0x02,
  ORIENT_YZX = 0x03,
  ORIENT_ZXY = 0x04,
  ORIENT_ZYX = 0x05
} LSM6DSO_ORIENT_t;

/*******************************************************************************
 * Register      : ORIENT_CFG_G
 * Address       : 0x0B
 * Bit Group Name: SIGN_Z_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SIGN_Z_G_POSITIVE = 0x00,
  SIGN_Z_G_NEGATIVE = 0x08,
} LSM6DSO_SIGN_Z_G_t;

/*******************************************************************************
 * Register      : ORIENT_CFG_G
 * Address       : 0x0B
 * Bit Group Name: SIGN_Y_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SIGN_Y_G_POSITIVE = 0x00,
  SIGN_Y_G_NEGATIVE = 0x10,
} LSM6DSO_SIGN_Y_G_t;

