jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : ORIENT_CFG_G
 * Address       : 0x0B
 * Bit Group Name: SIGN_X_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SIGN_X_G_POSITIVE = 0x00,
  SIGN_X_G_NEGATIVE = 0x20,
} LSM6DSO_SIGN_X_G_t;

/*******************************************************************************
 * Register      : REFERENCE_G
 * Address       : 0x0C
 * Bit Group Name: REF_G
 * Permission    : RW
 *******************************************************************************/
#define  	REF_G_MASK  	0xFF
#define  	REF_G_POSITION  	0

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_DRDY_XL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_DRDY_XL_DISABLED = 0x00,
  INT1_DRDY_XL_ENABLED = 0x01,
} LSM6DSO_INT1_DRDY_XL_t;

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_DRDY_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_DRDY_G_DISABLED = 0x00,
  INT1_DRDY_G_ENABLED = 0x02,
} LSM6DSO_INT1_DRDY_G_t;

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_BOOT
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_INT1_BOOT {
  INT1_BOOT_DISABLED = 0x00,
  INT1_BOOT_ENABLED = 0x04,
};

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_FULL_TH
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_INT1_TH_FULL {
  INT1_FIFO_TH_DISABLED = 0x00,
  INT1_FIFO_TH_ENABLED = 0x08,
};

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_FIFO_OVR
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_INT1_FIFO_OVR {
  INT1_FIFO_OVR_DISABLED = 0x00,
  INT1_FIFO_OVR_ENABLED = 0x10,
};

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_FIFO_FULL
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_INT1_FIFO_FULL {
  INT1_FIFO_FULL_DISABLED = 0x00,
  INT1_FIFO_FULL_ENABLED = 0x20,
};

/*******************************************************************************
 * Register      : INT1_CTRL
 * Address       : 0x0D
 * Bit Group Name: INT1_CNT_BDR
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_CNT_BDR_DISABLED = 0x00,
  INT1_CNT_BDR_ENABLED = 0x40,
} LSM6DSO_INT1_CNT_BDR_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_DRDY_XL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_DRDY_XL_DISABLED = 0x00,
  INT2_DRDY_XL_ENABLED = 0x01,
} LSM6DSO_INT2_DRDY_XL_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_DRDY_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_DRDY_G_DISABLED = 0x00,
  INT2_DRDY_G_ENABLED = 0x02,
} LSM6DSO_INT2_DRDY_G_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_DRDY_TEMP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_DRDY_TEMP_DISABLED = 0x00,
  INT2_DRDY_TEMP_ENABLED = 0x04,
} LSM6DSO_INT2_DRDY_TEMP_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_FIFO_TH
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_FIFO_TH_DISABLED = 0x00,
  INT2_FIFO_TH_ENABLED = 0x08,
} LSM6DSO_INT2_FIFO_TH_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_FIFO_OVR
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_FIFO_OVR_DISABLED = 0x00,
  INT2_FIFO_OVR_ENABLED = 0x10,
} LSM6DSO_INT2_FIFO_OVR_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_FIFO_FULL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_FIFO_FULL_DISABLED = 0x00,
  INT2_FIFO_FULL_ENABLED = 0x20,
} LSM6DSO_INT2_FIFO_FULL_t;

/*******************************************************************************
 * Register      : INT2_CTRL
 * Address       : 0x0E
 * Bit Group Name: INT2_CNT_BDR
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_CNT_BDR_DISABLED = 0x00,
  INT2_CNT_BDR_ENABLE = 0x40,
} LSM6DSO_INT2_CNT_BDR_t;

/*******************************************************************************
 * Register      : WHO_AM_I
 * Address       : 0x0F
 * Bit Group Name: WHO_AM_I_BIT
 * Permission    : RO
 *******************************************************************************/
#define  	WHO_AM_I_BIT_MASK  	0xFF
#define  	WHO_AM_I_BIT_POSITION  	0

