jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : CTRL1_XL
 * Address       : 0x10
 * Bits          : [1]
 * Bit Group Name: LPF2_XL_EN
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_LPF2_XL {
  LPF2_XL_DISABLE = 0x00,
  LPF2_XL_EN = 0x02
};

/*******************************************************************************
 * Register      : CTRL1_XL
 * Address       : 0x10
 * Bits          : [3:2]
 * Bit Group Name: FS_XL
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FS_XL {
  FS_XL_2g = 0x00,
  FS_XL_16g = 0x04,
  FS_XL_4g = 0x08,
  FS_XL_8g = 0x0C,
  FS_XL_MASK = 0xF3
};

/*******************************************************************************
 * Register      : CTRL1_XL
 * Address       : 0x10
 * Bits          : [7:4]
 * Bit Group Name: ODR_XL
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_ODR_XL {
  ODR_XL_DISABLE = 0x00,
  ODR_XL_1_6Hz = 0xB0, // Low Power only
  ODR_XL_12_5Hz = 0x10, // Low Power only
  ODR_XL_26Hz = 0x20, // Low Power only
  ODR_XL_52Hz = 0x30, // Low Power only
  ODR_XL_104Hz = 0x40, // Normal Mode
  ODR_XL_208Hz = 0x50, // Normal Mode
  ODR_XL_416Hz = 0x60, // High performance
  ODR_XL_833Hz = 0x70, // High Performance
  ODR_XL_1660Hz = 0x80, // High Performance
  ODR_XL_3330Hz = 0x90, // High Performance
  ODR_XL_6660Hz = 0xA0, // High Performance
  ODR_XL_MASK = 0x0F
};

/*******************************************************************************
 * Register      : CTRL2_G
 * Address       : 0x11
 * Bit           : [3:2]
 * Bit Group Name: FS_G
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FS_G {
  FS_G_125dps = 0x02,
  FS_G_250dps = 0x00,
  FS_G_500dps = 0x04,
  FS_G_1000dps = 0x08,
  FS_G_2000dps = 0x0C,
  FS_G_MASK = 0xF0
};

/*******************************************************************************
 * Register      : CTRL2_G
 * Address       : 0x11
 * Bit           : [7:4]
 * Bit Group Name: ODR_G
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_ODR_GYRO_G {
  ODR_GYRO_DISABLE = 0x00,
  ODR_GYRO_12_5Hz = 0x10, // Low Power only
  ODR_GYRO_26Hz = 0x20, // Low Power only
  ODR_GYRO_52Hz = 0x30, // Low Power only
  ODR_GYRO_104Hz = 0x40, // Normal Mode
  ODR_GYRO_208Hz = 0x50, // Normal Mode
  ODR_GYRO_416Hz = 0x60, // High performance
  ODR_GYRO_833Hz = 0x70, // High Performance
  ODR_GYRO_1660Hz = 0x80, // High Performance
  ODR_GYRO_3330Hz = 0x90, // High Performance
  ODR_GYRO_6660Hz = 0xA0, // High Performance
  ODR_GYRO_MASK = 0x0F
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: SW_RESET
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_SW_RESET {
  SW_RESET_NORMAL_MODE = 0x00,
  SW_RESET_DEVICE = 0x01,
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: IF_INC
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_IF_INC {
  IF_INC_DISABLED = 0x00,
  IF_INC_ENABLED = 0x04,
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: SIM
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_SIM {
  SIM_4_WIRE = 0x00,
  SIM_3_WIRE = 0x08,
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: PP_OD
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_PP_OD {
  PP_OD_PUSH_PULL = 0x00,
  PP_OD_OPEN_DRAIN = 0x10,
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: H_LACTIVE
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_H_LACTIVE {
  INT_ACTIVE_HIGH = 0x00,
  INT_ACTIVE_LOW = 0x20,
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: BDU
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_BDU {
  BDU_CONTINUOS = 0x00,
  BDU_BLOCK_UPDATE = 0x40,
  BDU_MASK = 0xBF
};

/*******************************************************************************
 * Register      : CTRL3_C
 * Address       : 0x12
 * Bit Group Name: BOOT
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_BOOT {
  BOOT_NORMAL_MODE = 0x00,
  BOOT_REBOOT_MODE = 0x80,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: STOP_ON_FTH
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_STOP_ON_FTH {
  STOP_ON_FTH_DISABLED = 0x00,
  STOP_ON_FTH_ENABLED = 0x01,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: MODE3_EN
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_MODE3_EN {
  MODE3_EN_DISABLED = 0x00,
  MODE3_EN_ENABLED = 0x02,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: I2C_DISABLE
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_I2C_DISABLE {
  I2C_DISABLE_I2C_AND_SPI = 0x00,
  I2C_DISABLE_SPI_ONLY = 0x04,
};

