jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: DRDY_MSK
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_DRDY_MSK {
  DRDY_MSK_DISABLED = 0x00,
  DRDY_MSK_ENABLED = 0x08,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: FIFO_TEMP_EN
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_FIFO_TEMP_EN {
  FIFO_TEMP_EN_DISABLED = 0x00,
  FIFO_TEMP_EN_ENABLED = 0x10,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: INT2_ON_INT1
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_INT2_ON_INT1 {
  INT2_ON_INT1_DISABLED = 0x00,
  INT2_ON_INT1_ENABLED = 0x20,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: SLEEP_G
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_SLEEP_G {
  SLEEP_G_DISABLED = 0x00,
  SLEEP_G_ENABLED = 0x40,
};

/*******************************************************************************
 * Register      : CTRL4_C
 * Address       : 0x13
 * Bit Group Name: BW_SCAL_ODR
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_BW_SCAL_ODR {
  BW_SCAL_ODR_DISABLED = 0x00,
  BW_SCAL_ODR_ENABLED = 0x80,
};

/*******************************************************************************
 * Register      : CTRL5_C
 * Address       : 0x14
 * Bit Group Name: ST_XL
 * Permission    : RW
 *******************************************************************************/
enum LSM6DSO_ST_XL {
  ST_XL_NORMAL_MODE = 0x00,
  ST_XL_POS_SIGN_TEST = 0x01,
  ST_XL_NEG_SIGN_TEST = 0x02,
  ST_XL_NA = 0x03,
};

/*******************************************************************************
 * Register      : CTRL5_C
 * Address       : 0x14
 * Bit Group Name: ST_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  ST_G_NORMAL_MODE = 0x00,
  ST_G_POS_SIGN_TEST = 0x04,
  ST_G_NA = 0x08,
  ST_G_NEG_SIGN_TEST = 0x0C,
} LSM6DSO_ST_G_t;

/*******************************************************************************
 * Register      : CTRL6_C
 * Address       : 0x15
 * Bits          : [2:0]
 * Bit Group Name: FTYPE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  FTYPE_ONE = 0x00,
  FTYPE_TWO = 0x01,
  FTYPE_THREE = 0x02,
  FTYPE_FOUR = 0x03,
  FTYPE_FIVE = 0x04,
  FTYPE_SIX = 0x05,
  FTYPE_SEVEN = 0x06,
  FTYPE_EIGHT = 0x07,
  FTYPE_NINE = 0x08,
  FTYPE_TEN = 0x09
} LSM6DSO_FTYPE_t;

/*******************************************************************************
 * Register      : CTRL6_C
 * Address       : 0x15
 * Bit Group Name: USR_OFF_W
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  USER_OFFSET_2_10 = 0x00,
  USER_OFFSET_2_6 = 0x08,
} LSM6DSO_USER_OFFSET_t;

/*******************************************************************************
 * Register      : CTRL6_C
 * Address       : 0x15
 * Bit Group Name: XL_HM_MODE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  HIGH_PERF_ACC_ENABLE = 0x00, //Default
  HIGH_PERF_ACC_DISABLE = 0x10,
} LSM6DSO_HIGH_PERF_ACC_t;

/*******************************************************************************
 * Register      : CTRL6_C
 * Address       : 0x15
 * Bits          : [7:5]
 * Bit Group Names: TRIG_EN, LVL1_EN, LVL2_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TRIG_MODE_EDGE = 0x80,
  TRIG_MODE_TRIGGER = 0x40,
  TRIG_MODE_LATCH = 0x30,
  TRIG_MODE_FIFO = 0x60,
} LSM6DSO_TRIG_MODE_t;

/*******************************************************************************
 * Register      : CTRL7_G
 * Address       : 0x16
 * Bit Group Name: G_HM_MODE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  HIGH_PERF_GYRO_ENABLE = 0x00,
  HIGH_PERF_GYRO_DISABLE = 0x80
} LSM6DSO_HIGH_PERF_GYRO_t;

/*******************************************************************************
 * Register      : CTRL7_G
 * Address       : 0x16
 * Bit Group Name: HP_EN_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  HP_EN_DISABLED = 0x00,
  HP_EN_ENABLED = 0x40,
} LSM6DSO_HP_EN_t;

/*******************************************************************************
 * Register      : CTRL7_G
 * Address       : 0x16
 * Bit Group Name: HPM_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  HPM_G_16mHz = 0x00,
  HPM_G_65mHz = 0x20,
  HPM_G_260mHz = 0x30,
  HPM_G_1_04Hz = 0x40,
} LSM6DSO_HPM_G_t;

/*******************************************************************************
 * Register      : CTRL8_XL
 * Address       : 0x17
 * Bit Group Name: FDS
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  FDS_FILTER_OFF = 0x00,
  FDS_FILTER_ON = 0x04,
} LSM6DSO_FDS_t;

/*******************************************************************************
 * Register      : CTRL9_XL
 * Address       : 0x18
 * Bit Group Name: XEN_XL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  XEN_XL_DISABLED = 0x00,
  XEN_XL_ENABLED = 0x08,
} LSM6DSO_XEN_XL_t;

