jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : CTRL9_XL
 * Address       : 0x18
 * Bit Group Name: YEN_XL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  YEN_XL_DISABLED = 0x00,
  YEN_XL_ENABLED = 0x10,
} LSM6DSO_YEN_XL_t;

/*******************************************************************************
 * Register      : CTRL9_XL
 * Address       : 0x18
 * Bit Group Name: ZEN_XL
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  ZEN_XL_DISABLED = 0x00,
  ZEN_XL_ENABLED = 0x20,
} LSM6DSO_ZEN_XL_t;

/*******************************************************************************
 * Register      : CTRL10_C
 * Address       : 0x19
 * Bit Group Name: XEN_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  XEN_G_DISABLED = 0x00,
  XEN_G_ENABLED = 0x08,
} LSM6DSO_XEN_G_t;

/*******************************************************************************
 * Register      : CTRL10_C
 * Address       : 0x19
 * Bit Group Name: YEN_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  YEN_G_DISABLED = 0x00,
  YEN_G_ENABLED = 0x10,
} LSM6DSO_YEN_G_t;

/*******************************************************************************
 * Register      : CTRL10_C
 * Address       : 0x19
 * Bit Group Name: ZEN_G
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  ZEN_G_DISABLED = 0x00,
  ZEN_G_ENABLED = 0x20,
} LSM6DSO_ZEN_G_t;

/*******************************************************************************
 * Register      : CTRL10_C
 * Address       : 0x19
 * Bit Group Name: FUNC_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  FUNC_EN_DISABLED = 0x00,
  FUNC_EN_ENABLED = 0x04,
} LSM6DSO_FUNC_EN_t;

/*******************************************************************************
 * Register      : ALL_INT_SRC
 * Address       : 0x1A
 * Permission    : R
 *******************************************************************************/
typedef enum {
  INT_FREE_FALL = 0x01,
  INT_WAKE_UP = 0x02,
  INT_SINGLE_TAP = 0x04,
  INT_DOUBLE_TAP = 0x08,
  INT_D6D = 0x10,
  INT_SLEEP_CHANGEN = 0x20,
  INT_TIMESTAMP_ENDCOUNT = 0x80,
} LSM6DSO_ALL_INT_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: MASTER_ON
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  MASTER_ON_DISABLED = 0x00,
  MASTER_ON_ENABLED = 0x01,
} LSM6DSO_MASTER_ON_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: IRON_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  IRON_EN_DISABLED = 0x00,
  IRON_EN_ENABLED = 0x02,
} LSM6DSO_IRON_EN_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: PASS_THRU_MODE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  PASS_THRU_MODE_DISABLED = 0x00,
  PASS_THRU_MODE_ENABLED = 0x04,
} LSM6DSO_PASS_THRU_MODE_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: PULL_UP_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  PULL_UP_EN_DISABLED = 0x00,
  PULL_UP_EN_ENABLED = 0x08,
} LSM6DSO_PULL_UP_EN_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: START_CONFIG
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  START_CONFIG_XL_G_DRDY = 0x00,
  START_CONFIG_EXT_INT2 = 0x10,
} LSM6DSO_START_CONFIG_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: DATA_VAL_SEL_FIFO
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  DATA_VAL_SEL_FIFO_XL_G_DRDY = 0x00,
  DATA_VAL_SEL_FIFO_SHUB_DRDY = 0x40,
} LSM6DSO_DATA_VAL_SEL_FIFO_t;

/*******************************************************************************
 * Register      : MASTER_CONFIG
 * Address       : 0x1A
 * Bit Group Name: DRDY_ON_INT1
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  DRDY_ON_INT1_DISABLED = 0x00,
  DRDY_ON_INT1_ENABLED = 0x80,
} LSM6DSO_DRDY_ON_INT1_t;

/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: Z_WU
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  Z_WU_NOT_DETECTED = 0x00,
  Z_WU_DETECTED = 0x01,
} LSM6DSO_Z_WU_t;

/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: Y_WU
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  Y_WU_NOT_DETECTED = 0x00,
  Y_WU_DETECTED = 0x02,
} LSM6DSO_Y_WU_t;

/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: X_WU
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  X_WU_NOT_DETECTED = 0x00,
  X_WU_DETECTED = 0x04,
} LSM6DSO_X_WU_t;

