jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: WU_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  WU_EV_STATUS_NOT_DETECTED = 0x00,
  WU_EV_STATUS_DETECTED = 0x08,
} LSM6DSO_WU_EV_STATUS_t;

/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: SLEEP_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  SLEEP_EV_STATUS_NOT_DETECTED = 0x00,
  SLEEP_EV_STATUS_DETECTED = 0x10,
} LSM6DSO_SLEEP_EV_STATUS_t;

/*******************************************************************************
 * Register      : WAKE_UP_SRC
 * Address       : 0x1B
 * Bit Group Name: FF_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  FF_EV_STATUS_NOT_DETECTED = 0x00,
  FF_EV_STATUS_DETECTED = 0x20,
} LSM6DSO_FF_EV_STATUS_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: Z_TAP
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  Z_TAP_NOT_DETECTED = 0x00,
  Z_TAP_DETECTED = 0x01,
} LSM6DSO_Z_TAP_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: Y_TAP
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  Y_TAP_NOT_DETECTED = 0x00,
  Y_TAP_DETECTED = 0x02,
} LSM6DSO_Y_TAP_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: X_TAP
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  X_TAP_NOT_DETECTED = 0x00,
  X_TAP_DETECTED = 0x04,
} LSM6DSO_X_TAP_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: TAP_SIGN
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  TAP_SIGN_POS_SIGN = 0x00,
  TAP_SIGN_NEG_SIGN = 0x08,
} LSM6DSO_TAP_SIGN_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: DOUBLE_TAP
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DOUBLE_TAP_NOT_DETECTED = 0x00,
  DOUBLE_TAP_DETECTED = 0x10,
} LSM6DSO_DOUBLE_TAP_EV_STATUS_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: SINGLE_TAP
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  SINGLE_TAP_NOT_DETECTED = 0x00,
  SINGLE_TAP_DETECTED = 0x20,
} LSM6DSO_SINGLE_TAP_EV_STATUS_t;

/*******************************************************************************
 * Register      : TAP_SRC
 * Address       : 0x1C
 * Bit Group Name: TAP_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  TAP_EV_NOT_DETECTED = 0x00,
  TAP_EV_DETECTED = 0x40,
} LSM6DSO_TAP_EV_STATUS_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_XL
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_XL_NOT_DETECTED = 0x00,
  DSD_XL_DETECTED = 0x01,
} LSM6DSO_DSD_XL_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_XH
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_XH_NOT_DETECTED = 0x00,
  DSD_XH_DETECTED = 0x02,
} LSM6DSO_DSD_XH_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_YL
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_YL_NOT_DETECTED = 0x00,
  DSD_YL_DETECTED = 0x04,
} LSM6DSO_DSD_YL_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_YH
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_YH_NOT_DETECTED = 0x00,
  DSD_YH_DETECTED = 0x08,
} LSM6DSO_DSD_YH_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_ZL
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_ZL_NOT_DETECTED = 0x00,
  DSD_ZL_DETECTED = 0x10,
} LSM6DSO_DSD_ZL_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: DSD_ZH
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  DSD_ZH_NOT_DETECTED = 0x00,
  DSD_ZH_DETECTED = 0x20,
} LSM6DSO_DSD_ZH_t;

/*******************************************************************************
 * Register      : D6D_SRC
 * Address       : 0x1D
 * Bit Group Name: D6D_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  D6D_EV_STATUS_NOT_DETECTED = 0x00,
  D6D_EV_STATUS_DETECTED = 0x40,
} LSM6DSO_D6D_EV_STATUS_t;

