jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : STATUS_REG
 * Address       : 0x1E
 * Bit Group Name: XLDA
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  XLDA_NO_DATA_AVAIL = 0x00,
  XLDA_DATA_AVAIL = 0x01,
} LSM6DSO_XLDA_t;

/*******************************************************************************
 * Register      : STATUS_REG
 * Address       : 0x1E
 * Bit Group Name: GDA
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  GDA_NO_DATA_AVAIL = 0x00,
  GDA_DATA_AVAIL = 0x02,
} LSM6DSO_GDA_t;

/*******************************************************************************
 * Register      : STATUS_REG
 * Address       : 0x1E
 * Bit Group Name: EV_BOOT
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  EV_BOOT_NO_BOOT_RUNNING = 0x00,
  EV_BOOT_BOOT_IS_RUNNING = 0x08,
} LSM6DSO_EV_BOOT_t;

/*******************************************************************************
 * Register      : FIFO_STATUS1
 * Address       : 0x3A
 * Bit Group Name: DIFF_FIFO
 * Permission    : RO
 *******************************************************************************/
#define  	DIFF_FIFO_STATUS1_MASK  	0xFF
#define  	DIFF_FIFO_STATUS1_POSITION  	0
#define  	DIFF_FIFO_STATUS2_MASK  0xF
#define  	DIFF_FIFO_STATUS2_POSITION  	0

/*******************************************************************************
 * Register      : FIFO_STATUS2
 * Address       : 0x3B
 * Bit Group Name: FIFO_EMPTY
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  FIFO_EMPTY_FIFO_NOT_EMPTY = 0x00,
  FIFO_EMPTY_FIFO_EMPTY = 0x10,
} LSM6DSO_FIFO_EMPTY_t;

/*******************************************************************************
 * Register      : FIFO_STATUS2
 * Address       : 0x3B
 * Bit Group Name: FIFO_FULL
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  FIFO_FULL_FIFO_NOT_FULL = 0x00,
  FIFO_FULL_FIFO_FULL = 0x20,
} LSM6DSO_FIFO_FULL_t;

/*******************************************************************************
 * Register      : FIFO_STATUS2
 * Address       : 0x3B
 * Bit Group Name: OVERRUN
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  OVERRUN_NO_OVERRUN = 0x00,
  OVERRUN_OVERRUN = 0x40,
} LSM6DSO_OVERRUN_t;

/*******************************************************************************
 * Register      : FIFO_STATUS2
 * Address       : 0x3B
 * Bit Group Name: WTM
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  WTM_BELOW_WTM = 0x00,
  WTM_ABOVE_OR_EQUAL_WTM = 0x80,
} LSM6DSO_WTM_t;

/*******************************************************************************
 * Register      : FIFO_DATA_OUT_TAG
 * Address       : 0x78
 * Bit Group Name: TAG_SENSOR
 * Permission    : R
 *******************************************************************************/
typedef enum {
  TAG_GYRO_NC = 0x01,
  TAG_ACCEL_NC = 0x02,
  TAG_TEMPERATURE = 0x03,
  TAG_TIME_STAMP = 0x04,
  TAG_CFG_CHANGE = 0x05,
  TAG_ACCEL_NC_T_2 = 0x06,
  TAG_ACCEL_NC_T_1 = 0x07,
  TAG_ACCEL_2xC = 0x08,
  TAG_ACCEL_3xC = 0x09,
  TAG_GYRO_NC_T_2 = 0x0A,
  TAG_GYRO_NC_T_1 = 0x0B,
  TAG_GYRO_2xC = 0x0C,
  TAG_GYRO_3xC = 0x0D,
  TAG_SENSOR_HUB_0 = 0x0E,
  TAG_SENSOR_HUB_1 = 0x0F,
  TAG_SENSOR_HUB_2 = 0x10,
  TAG_SENSOR_HUB_3 = 0x11,
  STEP_COUNTER = 0x12,
  SENSOR_HUB_NACK = 0x19,
} LSM6DSO_FIFO_TAG_t;

/*******************************************************************************
 * Register      : FUNC_SRC
 * Address       : 0x53
 * Bit Group Name: SENS_HUB_END
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  SENS_HUB_END_STILL_ONGOING = 0x00,
  SENS_HUB_END_OP_COMPLETED = 0x01,
} LSM6DSO_SENS_HUB_END_t;

/*******************************************************************************
 * Register      : FUNC_SRC
 * Address       : 0x53
 * Bit Group Name: SOFT_IRON_END
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  SOFT_IRON_END_NOT_COMPLETED = 0x00,
  SOFT_IRON_END_COMPLETED = 0x02,
} LSM6DSO_SOFT_IRON_END_t;

/*******************************************************************************
 * Register      : FUNC_SRC
 * Address       : 0x53
 * Bit Group Name: PEDO_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  PEDO_EV_STATUS_NOT_DETECTED = 0x00,
  PEDO_EV_STATUS_DETECTED = 0x10,
} LSM6DSO_PEDO_EV_STATUS_t;

/*******************************************************************************
 * Register      : FUNC_SRC
 * Address       : 0x53
 * Bit Group Name: TILT_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  TILT_EV_STATUS_NOT_DETECTED = 0x00,
  TILT_EV_STATUS_DETECTED = 0x20,
} LSM6DSO_TILT_EV_STATUS_t;

/*******************************************************************************
 * Register      : FUNC_SRC
 * Address       : 0x53
 * Bit Group Name: SIGN_MOT_EV_STATUS
 * Permission    : RO
 *******************************************************************************/
typedef enum {
  SIGN_MOT_EV_STATUS_NOT_DETECTED = 0x00,
  SIGN_MOT_EV_STATUS_DETECTED = 0x40,
} LSM6DSO_SIGN_MOT_EV_STATUS_t;

/*******************************************************************************
 * Register      : TAP_CFG0
 * Address       : 0x56
 * Bit Group Name: LIR
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  LIR_DISABLED = 0x00,
  LIR_ENABLED = 0x01,
  LIR_MASK = 0xFE
} LSM6DSO_LIR_t;

