jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
#define TAP_INTERRUPT_MASK 0xF1
/*******************************************************************************
 * Register      : TAP_CFG0
 * Address       : 0x56
 * Bit Group Name: TAP_Z_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TAP_Z_EN_DISABLED = 0x00,
  TAP_Z_EN_ENABLED = 0x02,
} LSM6DSO_TAP_Z_EN_t;

/*******************************************************************************
 * Register      : TAP_CFG0
 * Address       : 0x56
 * Bit Group Name: TAP_Y_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TAP_Y_EN_DISABLED = 0x00,
  TAP_Y_EN_ENABLED = 0x04,
} LSM6DSO_TAP_Y_EN_t;

/*******************************************************************************
 * Register      : TAP_CFG0
 * Address       : 0x56
 * Bit Group Name: TAP_X_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TAP_X_EN_DISABLED = 0x00,
  TAP_X_EN_ENABLED = 0x08,
} LSM6DSO_TAP_X_EN_t;

/*******************************************************************************
 * Register      : TAP_CFG0
 * Address       : 0x56
 * Bit Group Name: TAP_X_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT_CLR_ON_READ_AT_ODR = 0x00,
  INT_CLR_ON_READ_IMMEDIATE = 0x80
} LSM6DSO_INT_CLEAR_ON_READ_t;

/*******************************************************************************
 * Register      : TAP_CFG1
 * Address       : 0x58
 * Bit Group Name: TAP_PRIORITY
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TAP_PRIORITY_XYZ = 0x00,
  TAP_PRIORITY_YXZ = 0x01,
  TAP_PRIORITY_XZY = 0x02,
  TAP_PRIORITY_ZYX = 0x03,
  //TAP_PRIORITY_XYZ 	 = 0x04, repeated
  TAP_PRIORITY_YZX = 0x05,
  TAP_PRIORITY_ZXY = 0x06,
  //TAP_PRIORITY_ZYX   = 0x07, repeated
  TAP_PRIORITY_MASK = 0x1F
} LSM6DSO_TAP_PRIORITY_t;

/*******************************************************************************
 * Register      : TAP_CFG2
 * Address       : 0x58
 * Bit Group Name: INTERRUPTS_ENABLE
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INTERRUPTS_DISABLED = 0x00,
  INTERRUPTS_ENABLED = 0x80,
  INTERRUPTS_MASK = 0x7F,
} LSM6DSO_INTERRUPTS_t;

/*******************************************************************************
 * Register      : EMB_FUNC_EN_A
 * Address       : 0x04
 * Bit Group Name: TILT_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TILT_DISABLED = 0x00,
  TILT_ENABLED = 0x10,
} LSM6DSO_TILT_EN_t;

/*******************************************************************************
 * Register      : EMB_FUNC_EN_A
 * Address       : 0x04
 * Bit Group Name: PEDO_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  PEDO_DISABLED = 0x00,
  PEDO_ENABLED = 0x08,
  PEDO_MASK = 0xF7,
} LSM6DSO_PEDO_EN_t;

/*******************************************************************************
 * Register      : EMB_FUNC_EN_A
 * Address       : 0x04
 * Bit Group Name: SIGN_MOTION_EN
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SIGN_MOTION_DISABLED = 0x00,
  SIGN_MOTION_ENABLED = 0x20,
} LSM6DSO_SIGN_MOTION_EN_t;

/*******************************************************************************
 * Register      : EMB_FUNC_SRC
 * Address       : 0x64
 * Bit Group Name: PEDO_RST_STEP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  PEDO_RST_STEP_ENABLED = 0x80,
  PEDO_RST_STEP_DISABLED = 0x00,
  PEDO_RST_STEP_MASK = 0x7F,
} PEDO_RST_STEP_t;

/*******************************************************************************
 * Register      : EMB_FUNC_SRC
 * Address       : 0x64
 * Bit Group Name: STEP_DETECTED
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  STEP_NOT_DETECED = 0x00,
  STEP_DETECED = 0x40,
  STEP_DETECED_MASK = 0xBF
} PEDO_STEP_DETECT_t;

/*******************************************************************************
 * Register      : TAP_THS_6D
 * Address       : 0x59
 * Bit Group Name: TAP_THS
 * Permission    : RW
 *******************************************************************************/
#define  	TAP_THS_MASK  	0x1F
#define  	TAP_THS_POSITION  	0

/*******************************************************************************
 * Register      : TAP_THS_6D
 * Address       : 0x59
 * Bit Group Name: SIXD_THS
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SIXD_THS_80_degree = 0x00,
  SIXD_THS_70_degree = 0x20,
  SIXD_THS_60_degree = 0x40,
  SIXD_THS_50_degree = 0x60,
} LSM6DSO_SIXD_THS_t;

/*******************************************************************************
 * Register      : INT_DUR2
 * Address       : 0x5A
 * Bit Group Name: SHOCK
 * Permission    : RW
 *******************************************************************************/
#define  	SHOCK_MASK  	0x03
#define  	SHOCK_POSITION  	0

/*******************************************************************************
 * Register      : INT_DUR2
 * Address       : 0x5A
 * Bit Group Name: QUIET
 * Permission    : RW
 *******************************************************************************/
#define  	QUIET_MASK  	0x0C
#define  	QUIET_POSITION  	2

/*******************************************************************************
 * Register      : INT_DUR2
 * Address       : 0x5A
 * Bit Group Name: DUR
 * Permission    : RW
 *******************************************************************************/
#define  	DUR_MASK  	0xF0
#define  	DUR_POSITION  	4

