jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : WAKE_UP_THS
 * Address       : 0x5B
 * Bit Group Name: WK_THS
 * Permission    : RW
 *******************************************************************************/
#define  	WK_THS_MASK  	0x3F
#define  	WK_THS_POSITION  	0

/*******************************************************************************
 * Register      : WAKE_UP_THS
 * Address       : 0x5B
 * Bit Group Name: INACTIVITY_ON
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INACTIVITY_ON_DISABLED = 0x00,
  INACTIVITY_ON_ENABLED = 0x40,
} LSM6DSO_INACTIVITY_ON_t;

/*******************************************************************************
 * Register      : WAKE_UP_THS
 * Address       : 0x5B
 * Bit Group Name: SINGLE_DOUBLE_TAP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  SINGLE_DOUBLE_TAP_DOUBLE_TAP = 0x00,
  SINGLE_DOUBLE_TAP_SINGLE_TAP = 0x80,
} LSM6DSO_SINGLE_DOUBLE_TAP_t;

/*******************************************************************************
 * Register      : WAKE_UP_DUR
 * Address       : 0x5C
 * Bit Group Name: SLEEP_DUR
 * Permission    : RW
 *******************************************************************************/
#define  	SLEEP_DUR_MASK  	0x0F
#define  	SLEEP_DUR_POSITION  	0

/*******************************************************************************
 * Register      : WAKE_UP_DUR
 * Address       : 0x5C
 * Bit Group Name: TIMER_HR
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  TIMER_HR_6_4ms = 0x00,
  TIMER_HR_25us = 0x10,
} LSM6DSO_TIMER_HR_t;

/*******************************************************************************
 * Register      : WAKE_UP_DUR
 * Address       : 0x5C
 * Bit Group Name: WAKE_DUR
 * Permission    : RW
 *******************************************************************************/
#define  	WAKE_DUR_MASK  	0x60
#define  	WAKE_DUR_POSITION  	5

/*******************************************************************************
 * Register      : FREE_FALL
 * Address       : 0x5D
 * Bit Group Name: FF_DUR
 * Permission    : RW
 *******************************************************************************/
#define  	FF_FREE_FALL_DUR_MASK  	0xF8
#define  	FF_FREE_FALL_DUR_POSITION  	3
#define  	FF_WAKE_UP_DUR_MASK  	0x80
#define  	FF_WAKE_UP_DUR_POSITION  	7

/*******************************************************************************
 * Register      : FREE_FALL
 * Address       : 0x5D
 * Bit Group Name: FF_THS
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  FF_THS_5 = 0x00,
  FF_THS_7 = 0x01,
  FF_THS_8 = 0x02,
  FF_THS_10 = 0x03,
  FF_THS_11 = 0x04,
  FF_THS_13 = 0x05,
  FF_THS_15 = 0x06,
  FF_THS_16 = 0x07,
} LSM6DSO_FF_THS_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_SHUB
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_SHUB_DISABLED = 0x00,
  INT1_SHUB_ENABLED = 0x01,
} LSM6DSO_INT1_SHUB_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_EMB_FUNC
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_EMB_FUNC_DISABLED = 0x00,
  INT1_EMB_FUNC_ENABLED = 0x02,
} LSM6DSO_INT1_TILT_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_6D
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_6D_DISABLED = 0x00,
  INT1_6D_ENABLED = 0x04,
} LSM6DSO_INT1_6D_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_DOUBLE_TAP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_DOUBLE_TAP_DISABLED = 0x00,
  INT1_DOUBLE_TAP_ENABLED = 0x08,
} LSM6DSO_INT1_TAP_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_FF
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_FF_DISABLED = 0x00,
  INT1_FF_ENABLED = 0x10,
} LSM6DSO_INT1_FF_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_WU
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_WU_DISABLED = 0x00,
  INT1_WU_ENABLED = 0x20,
} LSM6DSO_INT1_WU_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_SINGLE_TAP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_SINGLE_TAP_DISABLED = 0x00,
  INT1_SINGLE_TAP_ENABLED = 0x40,
  INT1_SINGLE_TAP_MASK = 0xBF
} LSM6DSO_INT1_SINGLE_TAP_t;

/*******************************************************************************
 * Register      : MD1_CFG
 * Address       : 0x5E
 * Bit Group Name: INT1_SLEEP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT1_SLEEP_DISABLED = 0x00,
  INT1_SLEEP_ENABLED = 0x80,
} LSM6DSO_INT1_SLEEP_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_TIMESTAMP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_TIMESTAMP_DISABLED = 0x00,
  INT2_TIMESTAMP_ENABLED = 0x01,
} LSM6DSO_INT2_TIMESTAMP_t;

