jtagjr/rocket_system/Rocket Sensor System STM32F405/App/Inc/AccelerometerLsm.h
/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_EMB_FUNC
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_EMB_FUNC_DISABLED = 0x00,
  INT2_EMB_FUNC_ENABLED = 0x02,
} LSM6DSO_INT2_EMB_FUNC_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_6D
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_6D_DISABLED = 0x00,
  INT2_6D_ENABLED = 0x04,
} LSM6DSO_INT2_6D_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_DOUBLE_TAP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_DOUBLE_TAP_DISABLED = 0x00,
  INT2_DOUBLE_TAP_ENABLED = 0x08,
} LSM6DSO_INT2_DOUBLE_TAP_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_FF
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_FF_DISABLED = 0x00,
  INT2_FF_ENABLED = 0x10,
} LSM6DSO_INT2_FF_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_WU
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_WU_DISABLED = 0x00,
  INT2_WU_ENABLED = 0x20,
} LSM6DSO_INT2_WU_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_SINGLE_TAP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_SINGLE_TAP_DISABLED = 0x00,
  INT2_SINGLE_TAP_ENABLED = 0x40,
} LSM6DSO_INT2_SINGLE_TAP_t;

/*******************************************************************************
 * Register      : MD2_CFG
 * Address       : 0x5F
 * Bit Group Name: INT2_SLEEP
 * Permission    : RW
 *******************************************************************************/
typedef enum {
  INT2_SLEEP_DISABLED = 0x00,
  INT2_SLEEP_ENABLED = 0x80,
} LSM6DSO_INT2_SLEEP_t;

struct FifoData {
  uint8_t tag;
  uint8_t pad;
  int16_t x;
  int16_t y;
  int16_t z;
};

class LSM6DSO : public LSM6DSOCore {
public:
  //IMU settings
  SensorSettings imuSettings;

  //Error checking
  uint16_t allOnesCounter;
  uint16_t nonSuccessCounter;

  LSM6DSO(bool lowAcc);
  bool sleep();
  bool startHighSpeedSampling(LSM6DSO_FS_XL accel_range, LSM6DSO_ODR_XL accel_odr_rate, LSM6DSO_FS_G gyro_range,
                              LSM6DSO_ODR_GYRO_G gyro_odr_rate, LSM6DSO_BDR_XL_FIFO accel_bdr_rate, LSM6DSO_BDR_GY_FIFO gyro_bdr_rate,
                              uint8_t watermark);
  bool initialize(uint8_t settings);
  bool setAccelRange(uint8_t);
  bool setAccelDataRate(uint16_t);
  bool setGyroDataRate(uint16_t);
  bool setGyroRange(uint16_t);
  bool setBlockDataUpdate(bool);
  bool setHighPerfAccel(bool);
  bool setHighPerfGyro(bool);

  bool GetSensorData(SensorData* data);

  uint8_t getAccelRange();
  float getAccelDataRate();
  float getGyroDataRate();
  uint16_t getGyroRange();
  uint8_t listenDataReady();
  uint8_t getAccelFullScale();
  uint8_t getAccelHighPerf();

  int16_t readRawAccelX();
  int16_t readRawAccelY();
  int16_t readRawAccelZ();
  int16_t readRawGyroX();
  int16_t readRawGyroY();
  int16_t readRawGyroZ();

  float readFloatAccelX();
  float readFloatAccelY();
  float readFloatAccelZ();
  float readFloatGyroX();
  float readFloatGyroY();
  float readFloatGyroZ();

  bool setInterruptOne(uint8_t);
  uint8_t getInterruptOne();
  bool configHardOutInt(uint8_t, uint8_t pushOrDrain = 0x00);
  bool setInterruptTwo(uint8_t);
  int16_t readRawTemp();
  float readTempC();
  float readTempF();

  bool getFifoStatus(uint16_t& numberOfSensorDataReady, FifoStatusBits& statusBits);
  uint16_t fifoRead(const uint16_t numberOfSensorDataReady, FifoData* data);

  float calcGyro(int16_t);
  float calcAccel(int16_t);

  bool setIncrement();
  bool softwareReset();
  uint8_t clearAllInt();
};

#endif  // End of __LSM6DSOIMU_H__ definition check
